viscoelastic/viscoelasticFluidFoam/profileExtrusion/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rheology
{
    type    &model;

    models
    (
        M1
        {
            type        Giesekus;
            rho         rho [1 -3 0 0 0 0 0] 1100.0;
            etaS        etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP        etaP [1 -1 -1 0 0 0 0] 233.26;
            lambda      lambda [0 0 1 0 0 0 0] 1.07e-3;
            alpha       alpha [0 0 0 0 0 0 0] 0.6;

            stabilization   IBSD;
        }
        M2
        {
            type        Giesekus;
            rho         rho [1 -3 0 0 0 0 0] 1100.0;
            etaS        etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP        etaP [1 -1 -1 0 0 0 0] 185.32;
            lambda      lambda [0 0 1 0 0 0 0] 1.13e-2;
            alpha       alpha [0 0 0 0 0 0 0] 0.6;

            stabilization   IBSD;
        }
        M3
        {
            type        Giesekus;
            rho         rho [1 -3 0 0 0 0 0] 1100.0;
            etaS        etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP        etaP [1 -1 -1 0 0 0 0] 192.178;
            lambda      lambda [0 0 1 0 0 0 0] 7.42e-2;
            alpha       alpha [0 0 0 0 0 0 0] 0.6;

            stabilization   IBSD;
        }
        M4
        {
            type        Giesekus;
            rho         rho [1 -3 0 0 0 0 0] 1100.0;
            etaS        etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP        etaP [1 -1 -1 0 0 0 0] 120.576;
            lambda      lambda [0 0 1 0 0 0 0] 4.71e-1;
            alpha       alpha [0 0 0 0 0 0 0] 0.6;

            stabilization   IBSD;
        }
        M5
        {
            type        Giesekus;
            rho         rho [1 -3 0 0 0 0 0] 1100.0;
            etaS        etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP        etaP [1 -1 -1 0 0 0 0] 54.684;
            lambda      lambda [0 0 1 0 0 0 0] 2.79;
            alpha       alpha [0 0 0 0 0 0 0] 0.6;

            stabilization   IBSD;
        }
        M6
        {
            type        Giesekus;
            rho         rho [1 -3 0 0 0 0 0] 1100.0;
            etaS        etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP        etaP [1 -1 -1 0 0 0 0] 26.2031;
            lambda      lambda [0 0 1 0 0 0 0] 9.13;
            alpha       alpha [0 0 0 0 0 0 0] 0.6;

            stabilization   IBSD;
        }
    );
}

// ************************************************************************* //
